In [1]:
import pandas as pd

import warnings
warnings.simplefilter('ignore')

Los datos están obtenidos en dos csv

In [2]:
gasto_isla = pd.read_csv('../Limpieza_Datasets/data/Gasto_isla.csv', sep = ';')
gasto_isla_2015 = pd.read_csv('../Limpieza_Datasets/data/Gasto_total_isla_2015.csv', sep=';')

In [3]:
gasto_isla

,Unnamed: 0,Gasto total (millones de euros),Gasto por persona (euros),Gasto por persona y día (euros)
0,2021M12,NaN,NaN,NaN
1,Mallorca,"139,15","886,78","111,45"
2,Menorca,"4,62","569,33","97,75"
3,Eivissa-Formentera,"18,89","743,48","89,62"
4,2021M11,NaN,NaN,NaN
...,...,...,...,...
295,Eivissa-Formentera,"15,55","596,44","87,05"
296,2015M10,NaN,NaN,NaN
297,Mallorca,"792,77","915,06","114,4"
298,Menorca,"50,27","806,03","95,52"
299,Eivissa-Formentera,147,"838,52","109,8"

Se cambia el nombre de columnas para unificar los dos dataframe posteriormente

In [4]:
gasto_isla = gasto_isla.rename(columns={'Unnamed: 0':'Isla',
                                       'Gasto total (millones de euros)':'Gasto_total',
                                       'Gasto por persona (euros)':'Gasto_persona',
                                       'Gasto por persona y día (euros)':'Gasto_persona_día'})

In [5]:
gasto_isla_2015 = gasto_isla_2015.rename(columns={'Unnamed: 0':'Isla',
                                                  'Gasto total':'Gasto_total',
                                                  'Gasto medio por persona':'Gasto_persona',
                                                  'Gasto medio diario':'Gasto_persona_día'})

In [6]:
gasto_isla.head(5)

                    Isla Gasto_total Gasto_persona Gasto_persona_día
0                2021M12         NaN           NaN               NaN
1               Mallorca      139,15        886,78            111,45
2                Menorca        4,62        569,33             97,75
3     Eivissa-Formentera       18,89        743,48             89,62
4                2021M11         NaN           NaN               NaN

Se elimina la columna 'Gasto_total' ya que la información está dada en diferentes medidas en cada df

In [7]:
def eliminar_columna(df):
    df.drop(['Gasto_total'], axis=1, inplace=True)

In [8]:
eliminar_columna(gasto_isla)
eliminar_columna(gasto_isla_2015)

In [ ]:
gasto_isla.head(10)

* Función 'inicio': Elimina espacios agregados al inicio de cada 'isla' y se añade una columna adicional para extraer el año y el mes.

* Función 'fecha': Iteración por toda la columna 'Isla' para que cada 4 rows agregue lo que encuentre en la columna 'mes/año'. Se elimina el patrón '2000M01' de la columna 'Isla'.

In [10]:
def inicio(df):
    df.insert(1, "Mes/año", "")
    
def fecha(df):
    count = 0
    cambioiloc = 0
    lista_general = []
    for i,row in df.iterrows():
        lista_general.append(df.iloc[cambioiloc]["Isla"])
        count += 1    
        if count == 4:
            cambioiloc = (i+1)
            count=0
    df["Mes/año"] = lista_general   

    for i, row in df.iterrows():
        if row['Isla'] in lista_general:
            df.drop(i, inplace=True)

In [11]:
inicio(gasto_isla)
inicio(gasto_isla_2015)

In [12]:
fecha(gasto_isla)
fecha(gasto_isla_2015)

In [13]:
gasto_isla.head()

                    Isla  Mes/año Gasto_persona Gasto_persona_día
1               Mallorca  2021M12        886,78            111,45
2                Menorca  2021M12        569,33             97,75
3     Eivissa-Formentera  2021M12        743,48             89,62
5               Mallorca  2021M11        886,79            126,19
6                Menorca  2021M11         589,2             96,37

Se crea una columna 'year' y otra 'month' para separar lo que contiene la columna que creamos 'Mes/año'

In [14]:
def month_year(df):
    df['year'], df['month'] = df["Mes/año"].str.split('M', 1).str
    df.drop(['Mes/año'], axis = 1, inplace= True)

In [15]:
month_year(gasto_isla)
month_year(gasto_isla_2015)

In [16]:
gasto_isla.head()

                    Isla Gasto_persona Gasto_persona_día  year month
1               Mallorca        886,78            111,45  2021    12
2                Menorca        569,33             97,75  2021    12
3     Eivissa-Formentera        743,48             89,62  2021    12
5               Mallorca        886,79            126,19  2021    11
6                Menorca         589,2             96,37  2021    11

Cambiar orden columnas para unir los df

In [17]:
gasto_isla.head(2)

          Isla Gasto_persona Gasto_persona_día  year month
1     Mallorca        886,78            111,45  2021    12
2      Menorca        569,33             97,75  2021    12

In [18]:
gasto_isla_2015.head(2)

          Isla Gasto_persona_día Gasto_persona  year month
1     Mallorca            112,89        919,91  2015    09
2      Menorca             96,06        844,17  2015    09

In [19]:
gasto_isla_2015 = gasto_isla_2015[['Isla','Gasto_persona','Gasto_persona_día','year','month']]

In [ ]:
#gasto_isla.head()

In [ ]:
#gasto_isla_2015.head()

In [20]:
gasto_total_ok = pd.concat([gasto_isla, gasto_isla_2015])

In [21]:
gasto_total_ok

                      Isla Gasto_persona Gasto_persona_día  year month
1                 Mallorca        886,78            111,45  2021    12
2                  Menorca        569,33             97,75  2021    12
3       Eivissa-Formentera        743,48             89,62  2021    12
5                 Mallorca        886,79            126,19  2021    11
6                  Menorca         589,2             96,37  2021    11
..                     ...           ...               ...   ...   ...
250                Menorca        855,42             94,17  2010    07
251     Eivissa-Formentera      1.052,04            126,35  2010    07
253               Mallorca        891,15            119,27  2010    06
254                Menorca        872,24            105,89  2010    06
255     Eivissa-Formentera        984,79            115,31  2010    06

[417 rows x 5 columns]

Revisar tipo de datos. Todos son 'object'

In [22]:
gasto_total_ok.dtypes

Isla                 object
Gasto_persona        object
Gasto_persona_día    object
year                 object
month                object
dtype: object

Se sustituyen puntos y comas y se aplica 'to_numeric' para convertirlo a float

In [23]:
def cambiar (strnum):

    strnum = strnum.replace(".","")
    return strnum.replace(",",".")

In [24]:
gasto_total_ok['Gasto_persona'] = gasto_total_ok['Gasto_persona'].apply(cambiar)
gasto_total_ok['Gasto_persona'] = pd.to_numeric(gasto_total_ok['Gasto_persona'], errors = 'coerce')

In [25]:
gasto_total_ok['Gasto_persona_día'] = gasto_total_ok['Gasto_persona_día'].apply(cambiar)
gasto_total_ok['Gasto_persona_día'] = pd.to_numeric(gasto_total_ok['Gasto_persona_día'], errors = 'coerce')

Los años y meses se convierten en enteros

In [26]:
gasto_total_ok['year'] = gasto_total_ok['year'].astype(str).astype(int)

In [27]:
gasto_total_ok['month'] = gasto_total_ok['month'].astype(str).astype(int)

El tipo de dato está ok

In [28]:
gasto_total_ok.dtypes

Isla                  object
Gasto_persona        float64
Gasto_persona_día    float64
year                   int64
month                  int64
dtype: object

In [ ]:
gasto_total_ok

En la columna 'Isla', cada nombre lleva espacios al inicio. Se eliminan

In [ ]:
#gasto_total_ok.Isla.unique()

In [29]:
gasto_total_ok['Isla'] = gasto_total_ok['Isla'].str.strip()

In [ ]:
#gasto_total_ok.Isla.unique()

Para unificar los nombres de las islas con el resto de csv, se indican los mismos nombres para las islas

In [30]:
def sustituir(x):
    if x == 'Eivissa-Formentera': 
        return 'Ibiza_Formentera'
    else:
        return x

In [31]:
gasto_total_ok.Isla = gasto_total_ok.Isla.apply(sustituir)

In [32]:
gasto_total_ok

                 Isla  Gasto_persona  Gasto_persona_día  year  month
1            Mallorca         886.78             111.45  2021     12
2             Menorca         569.33              97.75  2021     12
3    Ibiza_Formentera         743.48              89.62  2021     12
5            Mallorca         886.79             126.19  2021     11
6             Menorca         589.20              96.37  2021     11
..                ...            ...                ...   ...    ...
250           Menorca         855.42              94.17  2010      7
251  Ibiza_Formentera        1052.04             126.35  2010      7
253          Mallorca         891.15             119.27  2010      6
254           Menorca         872.24             105.89  2010      6
255  Ibiza_Formentera         984.79             115.31  2010      6

[417 rows x 5 columns]

In [ ]:
#gasto_total_ok.to_csv(r'gasto_persona_dia.csv', index = False, header=True)